package com.yujigu.summer.iwebot.wechat;

import lombok.Getter;

/**
 * 消息类型
 */
public enum EnumsMsgType {
    _0("0", "朋友圈消息"),
    _1("1", "文字"),
    _3("3", "图片"),
    _34("34", "语音"),
    _37("37", "好友确认"),
    _40("40", "POSSIBLEFRIEND_MSG"),
    _42("42", "名片"),
    _43("43", "视频"),
    _47("47", "石头剪刀布 | 表情图片"),
    _48("48", "位置"),
    _49("49", "共享实时位置、文件、转账、链接"),
    _50("50", "VOIPMSG"),
    _51("51", "微信初始化"),
    _52("52", "VOIPNOTIFY"),
    _53("53", "VOIPINVITE"),
    _62("62", "小视频"),
    _66("66", "微信红包"),
    _9999("9999", "SYSNOTICE"),
    _10000("10000", "红包、系统消息"),
    _10002("10002", "撤回消息"),
    _1048625("1048625", "搜狗表情"),
    _16777265("16777265", "链接"),
    _436207665("436207665", "微信红包"),
    _536936497("536936497", "红包封面"),
    _754974769("754974769", "视频号视频"),
    _771751985("771751985", "视频号名片"),
    _822083633("822083633", "引用消息"),
    _922746929("922746929", "拍一拍"),
    _973078577("973078577", "视频号直播"),
    _974127153("974127153", "商品链接"),
    _975175729("975175729", "视频号直播"),
    _1040187441("1040187441", "音乐链接"),
    _1090519089("1090519089", "文件");
    @Getter
    private String type;

    @Getter
    private String desc;

    EnumsMsgType(String type, String desc) {
        this.type = type;
        this.desc = desc;
    }
}
